# SchedulesCanBePlacedOnSheetsOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScheduleViewFailures..::..SchedulesCanBePlacedOnSheetsOnly Property
BuiltInFailures..::..ScheduleViewFailures Class See Also
---
Schedules can only be placed on Sheets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SchedulesCanBePlacedOnSheetsOnly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SchedulesCanBePlacedOnSheetsOnly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SchedulesCanBePlacedOnSheetsOnly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScheduleViewFailures Class
Autodesk.Revit.DB Namespace